tests/cases/moldSteady/system/verifyScript
verify-mold-steady.py
